{
  "blogPosts": [
    {
      "title": "Respect to the brave forces of Sri Lanka.",
      "description": "Amidst heavy rains and strong currents, our heroes stand firm.",
      "publishedDate": "2025-12-01",
      "fullContent": "<pre>Amidst heavy rains and strong currents, our heroes stand firm. 🇱🇰\nThe Sri Lankan Army, Navy, Air Force, and Police rise when nature tests us, risking their lives to protect ours.\n\nThrough floods and mudslides, they move with one mission — to save and serve.\nYou are our strength, our hope, our pride. 🇱🇰❤️\nRespect to the brave forces of Sri Lanka.\n\n#teamcdc\n#bandaranayake</pre>",
      "image": "https://i.ibb.co/TMngJZYH/You-Are-Our-Strength-Respoect-for-Forces-min.jpg"
    },
    {
      "title": "🚨 STAY SAFE : PRAY FOR SRI LANKA 🚨",
      "description": "Severe weather is affecting many parts of the island, and the Bandaranayake College Gampaha Coding Club urges everyone to stay alert and prioritize safety.",
      "publishedDate": "2025-11-20",
      "fullContent": "<pre>Severe weather is affecting many parts of the island, and the Bandaranayake College Gampaha Coding Club urges everyone to stay alert and prioritize safety.\n\n⚠️ IMPORTANT EMERGENCY NUMBERS\n📞 117 - Disaster Management Centre\n📞 119 - Police Emergency\n📞 110 - Rescue Services\n\nTogether, let's stay safe. Our thoughts are with everyone affected. 🙏💙\n\n#teamcdc\n#bcg\n#PrayForSriLanka\n#StaySafe</pre>",
      "image": "https://i.ibb.co/bjppMWst/STAY-SAFE-PRAY-FOR-SRILANKA.png"
    },
    {
      "title": "InterHouse Sports Scores 2025 - Bandaranayake College",
      "description": "The official digital platform for Bandaranayake College InterHouse Sports 2025. Track live rankings, comprehensive sports scores, athletics details, and celebrate house victories with real-time updates and mobile app access.",
      "publishedDate": "2025-10-15",
      "fullContent": "<pre>InterHouse Sports Scores 2025 – Your Digital Sports Hub!\nPowered by Bandaranayake College Coding Club - Experience the ultimate platform for interhouse sports excellence! Get real-time updates, comprehensive analytics, and celebrate sporting achievements with cutting-edge technology.\n\nOverall House Rankings 2025\nLive leaderboard with dynamic house standings! Track year-over-year performance, compare house achievements, and see who's dominating the 2025 competition with real-time point calculations.\n\nComprehensive Sports Scores\nInstant access to detailed match results across all sports disciplines. From athletics records to team sport outcomes, get complete breakdowns with performance metrics and historical comparisons.\n\nHouse Performance Analytics\nDeep dive into individual house statistics, member contributions, and detailed performance tracking. Interactive visualizations showcase each house's strengths and sporting journey.\n\nAthletics Details &amp; Records\nSpecialized athletics section featuring track and field results, record-breaking performances, and event-by-event analysis. Complete coverage of all athletic competitions with detailed timings and rankings.\n\nVictory Gallery 2025\nRelive the most thrilling sporting moments! Browse championship celebrations, record-breaking performances, and iconic highlights from the 2025 InterHouse Sports Meet.\n\nMobile-Optimized Experience\nAccess the platform seamlessly across all devices with mobile app capabilities. Get real-time notifications, offline access to key data, and stay connected to the action anywhere.\n\nCommunity Integration\nConnect with the coding excellence that powers this platform. Discover how innovation meets sports through digital technology and collaborative development.\n\nBuilt with modern web technologies and responsive design, InterHouse Sports Scores 2025 brings the excitement of competition to your fingertips!\n\n<a href=\"https://sportmeet-teamcdc.netlify.app/\" class=\"try-it-now-button\">Experience the 2025 Sports Hub!</a></pre>",
      "image": "https://i.ibb.co/HDtTgMPq/image.png"
    },
    {
      "title": "Introducing Time Genius Web App",
      "description": "Time Genius is an innovative time management web application for kids, designed to help them develop essential organizational skills while making learning fun",
      "publishedDate": "2025-09-20",
      "fullContent": "<pre>Helping Kids Master Time Management in a Fun and Engaging Way! Time Genius is an innovative time management web application for kids, designed to help them develop essential organizational skills while making learning fun. With a user-friendly interface, colorful animations, and interactive features, Time Genius empowers children to manage their daily tasks, set priorities, and build a structured routine—fostering responsibility and independence from an early age.\n\nWhy Time Genius?\nPersonalized Scheduling: Kids can input their subjects, assign priorities, and let the app generate a schedule based on their free time.\nEngaging Design: A visually appealing interface with playful colors, animations, and an intuitive layout keeps kids motivated.\nDynamic Features: Allows users to select free days, set activity hours, and even randomize schedules for variety.\nBuilt-in Timer: The \"Start Now\" button lets kids stay focused with a countdown for each task, enhancing time discipline.\nSave &amp; Access Anywhere: Easily save schedules online, access them anytime, and manage tasks seamlessly.\n\nHow It Works\n- Enter Subjects &amp; Priorities – Add subjects or tasks and set their importance.\n- Select Free Days &amp; Time Slots – Customize availability for better flexibility.\n- Generate &amp; Start Scheduling – The app creates an optimized schedule instantly.\n- Use the Timer &amp; Stay on Track – Click \"Start Now\" to begin tasks with a countdown.\nWith Time Genius, kids learn the art of time management, self-discipline, and productivity—valuable skills that benefit them throughout life!\n\n<a href=\"https://time-genius.netlify.app/\" class=\"try-it-now-button\">Try it now!</a></pre>",
      "image": "https://i.ibb.co/gJhczrG/image.png"
    }
  ]
}
